
Процедура ун30_ПередЗаписьюДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если НЕ Константы.ун30_Включить.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	имяМД = Источник.Метаданные().Имя;
	
	БазовыеНастройки = РегистрыСведений.ун30_ОбъектыНумерации.БазовыеНастройки(имяМД);
	БазовыеНастройки.Вставить("ДатаИсточника", Источник.Дата);
	
	Если БазовыеНастройки.Включить Тогда
		
		Если БазовыеНастройки.Перезаписывать Тогда
			Правила = РегистрыСведений.ун30_ПравилаНумерации.ПравилаНумерации(имяМД);
			
			НовыйНомер = ПолучитьНомерПоПравилам(Правила, БазовыеНастройки, Источник);
			
			Источник.Номер = НовыйНомер;
			
			Данные = Новый Структура;
			Данные.Вставить("ИмяДокумента", имяМД);
			Данные.Вставить("Номер", НовыйНомер);
			Данные.Вставить("Дата", Источник.Дата);
			
			РегистрыСведений.ун30_ТекущиеНомераДокументов.ЗаписатьНомерДокумента(Данные);
			РегистрыСведений.ун30_ТекущиеНомераДокументов.УвеличитьПорядковыйНомерДокумента(БазовыеНастройки);
			РегистрыСведений.ун30_ТекущиеНомераДокументов.ОбновитьСчетчик(Данные)
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьНомерПоПравилам(Правила, БазовыеНастройки, Источник)
	
	Результат = "";
	
	Если БазовыеНастройки.ВариантНумерации = 1 Тогда
		Результат = ПолучитьНомерФорматаДатыПоПравилам(Правила, БазовыеНастройки, Источник);
	ИначеЕсли БазовыеНастройки.ВариантНумерации = 2 Тогда
		Результат = ПолучитьНомерПоРеквизитуПоПравилам(Правила, БазовыеНастройки, Источник);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНомерФорматаДатыПоПравилам(Правила, БазовыеНастройки, Источник)
	
	Результат = "";
	
	НастройкиФорматаДаты = ун30_Сервер.ПолучитьНастройкиФорматаДаты(Правила.ФорматДаты);
	
	Результат = ун30_Сервер.СформироватьПримерНомераПоДате(НастройкиФорматаДаты, БазовыеНастройки);

	Возврат Результат;
	
КонецФункции

Функция ПолучитьНомерПоРеквизитуПоПравилам(Правила, БазовыеНастройки, Источник)
	
	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ун30_ПрефиксыРеквизитов.Префикс КАК Префикс
	|ИЗ
	|	РегистрСведений.ун30_ПрефиксыРеквизитов КАК ун30_ПрефиксыРеквизитов
	|ГДЕ
	|	ун30_ПрефиксыРеквизитов.ИмяДокумента = &ИмяДокумента
	|	И ун30_ПрефиксыРеквизитов.ИмяРеквизита = &ИмяРеквизита
	|	И ун30_ПрефиксыРеквизитов.ЗначениеРеквизита = &ЗначениеРеквизита";
	Запрос.УстановитьПараметр("ИмяДокумента", БазовыеНастройки.ИмяДокумента);
	Запрос.УстановитьПараметр("ИмяРеквизита", Правила.ИмяРеквизита);
	Запрос.УстановитьПараметр("ЗначениеРеквизита", Источник[Правила.ИмяРеквизита]);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Префикс = Выборка.Префикс;
	КонецЦикла;
	
	
	Возврат Результат;
	
	
	
КонецФункции
