
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИмяДокумента = Параметры.ИмяДокумента;
	мтд = Метаданные.Документы.Найти(ИмяДокумента);
	
	Для каждого Реквизит Из мтд.Реквизиты Цикл
		НС = РеквизитыДокумента.Добавить();
		НС.ИмяРеквизита = Реквизит.Имя;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура РеквизитыДокументаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Структура = Новый Структура;
	Структура.Вставить("Команда", "ВыборРеквизитаДокумента");
	Структура.Вставить("Реквизит", РеквизитыДокумента.НайтиПоИдентификатору(ВыбраннаяСтрока).ИмяРеквизита);
	ОповеститьОВыборе(Структура);
КонецПроцедуры

