
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПроизвольныйНомер = 21;
	ВариантНумерации = 1;
	ИмяДокумента = Параметры.ИмяДокумента;
	ПредставлениеДокумента = Параметры.ПредставлениеДокумента;
	ГодСчетчика = Год(ТекущаяДатаСеанса());
	НастройкиНумерации = Новый Структура;
	
	ЭтотОбъект.АвтоЗаголовок = Ложь;
	ЭтотОбъект.Заголовок = "Настройка нумерации";
	
	БазовыеНастройки = РегистрыСведений.ун30_ОбъектыНумерации.БазовыеНастройки(Параметры.ИмяДокумента);
	
	Если НЕ БазовыеНастройки.Успех ИЛИ НЕ БазовыеНастройки.Включить Тогда
		Включить = Ложь;
		НастроитьВидимость();
		Возврат;
	КонецЕсли;
	
	Если БазовыеНастройки.ВариантНумерации = 1 Тогда
		ЗаполнитьСписокВыбораФорматаДаты();
	КонецЕсли;
	
	НастройкиНумерации = РегистрыСведений.ун30_ПравилаНумерации.ПравилаНумерации(Параметры.ИмяДокумента);
	
	ЗаполнитьФормуПоНастройкам();
	
	СФормироватьПримерНомера();
	
	Массив = Новый Массив;
	Массив.Добавить(Тип(СтрШаблон("ДокументСсылка.%1", ИмяДокумента)));
	Описание = Новый ОписаниеТипов(Массив);
	
	Элементы.ДокументПример.ОграничениеТипа = Описание;
	ДокументПример = Описание.ПривестиЗначение();
	
	НастроитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьПриИзменении(Элемент)
	
	Если Включить Тогда
		ВключитьНаСервере();
		ЗаполнитьФормуПоНастройкам();
		СФормироватьПримерНомера();
		ОбновитьСчетчики();
		Если Элементы.ФорматДаты.СписокВыбора.Количество() = 0 Тогда
			ЗаполнитьСписокВыбораФорматаДаты(); 
		КонецЕсли;
	КонецЕсли;
	
	НастроитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ВключитьНаСервере()
	
	РегистрыСведений.ун30_ОбъектыНумерации.Включить(ИмяДокумента);
	БазовыеНастройки = РегистрыСведений.ун30_ОбъектыНумерации.БазовыеНастройки(ИмяДокумента);
КонецПроцедуры

&НаКлиенте
Процедура ВариантПрефиксацииПриИзменении(Элемент)
	НастройкиНумерации.Вставить("ВариантНумерации", ВариантНумерации);
	НастроитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура РазделительДатыПриИзменении(Элемент)
	СформироватьПримерНомера();
КонецПроцедуры

&НаКлиенте
Процедура ВариантИспользованияДатыПриИзменении(Элемент)
	СформироватьПримерНомера();
КонецПроцедуры

&НаКлиенте
Процедура ПроизвольныйНомерПриИзменении(Элемент)
	СФормироватьПримерНомера();
КонецПроцедуры

&НаКлиенте
Процедура РазделительПриИзменении(Элемент)
	СФормироватьПримерНомера();
КонецПроцедуры

&НаКлиенте
Процедура ГодСчетчикаПриИзменении(Элемент)
	ОбновитьСчетчики();
КонецПроцедуры

#КонецОбласти



#Область КомандыФормы

&НаСервере
Процедура СохранитьНастройкиНаСервере(Ошибка)
	
	ЗаписатьБазовыеНастройки(Ошибка);
	
	Если Включить Тогда
		ЗаписатьНастройки(Ошибка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	Ошибка = Ложь;
	СохранитьНастройкиНаСервере(Ошибка);
	Если Не Ошибка Тогда
		Сообщить("Настройки записаны");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СброситьПорядковыйНомер(Команда)
	Если ПорядковыйНомер = 0 Тогда
		Сообщить("Порядковый номер не может быть 0");
		Возврат;
	КонецЕсли;
	СброситьПорядковыйНомерНаСервере();
КонецПроцедуры

&НаСервере
Процедура СброситьПорядковыйНомерНаСервере()
	
	РегистрыСведений.ун30_ТекущиеНомераДокументов.УстановитьПорядковыйНомер(СтруктураДанные());
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСчетчики()
	
	Данные = СтруктураДанные();
	
	ПорядковыйНомер = РегистрыСведений.ун30_ТекущиеНомераДокументов.ПоследнийНомерДокумента(Данные).ПоследнийНомер;
	
	Счетчик = РегистрыСведений.ун30_ТекущиеНомераДокументов.ПолучитьСчетчик(Данные).Счетчик;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСчетчикДокументовНаСервере()
	Данные = СтруктураДанные();
	РегистрыСведений.ун30_ТекущиеНомераДокументов.ОбновитьСчетчик(Данные);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСчетчик(Команда)
	ОбновитьСчетчикДокументовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТекущиеНомера(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОчиститьТекущиеНомераПродолжение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Выполнить очистку счетчиков?", РежимДиалогаВопрос.ДаНет);

КонецПроцедуры


#КонецОбласти



#Область НастройкиНумерации

&НаСервере
Процедура ЗаписатьБазовыеНастройки(Ошибка)
	
	НастройкиНумерации.Вставить("Включить", Включить);
	НастройкиНумерации.Вставить("ВариантНумерации", ВариантНумерации);
	НастройкиНумерации.Вставить("ИмяДокумента", ИмяДокумента);
	НастройкиНумерации.Вставить("ПредставлениеДокумента", ПредставлениеДокумента);
	НастройкиНумерации.Вставить("Разделитель", Разделитель);
	НастройкиНумерации.Вставить("Перезаписывать", Перезаписывать);
	
	Попытка
		РегистрыСведений.ун30_ОбъектыНумерации.ЗаписатьНастройки(НастройкиНумерации);
	Исключение
		Ошибка = Истина;
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройки(Ошибка)
	
	Если ВариантНумерации = 1 Тогда
		УстановитьНастройкуФорматаДаты();
	ИначеЕсли ВариантНумерации = 2 Тогда
		УстановитьНастройкуРеквизита();
	КонецЕсли;
	
	
	Попытка
		РегистрыСведений.ун30_ПравилаНумерации.ЗаписатьНастройки(НастройкиНумерации);
	Исключение
		Ошибка = Истина;
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуПоНастройкам()
	
	Включить 			= БазовыеНастройки.Включить;
	Разделитель 		= БазовыеНастройки.Разделитель;
	Перезаписывать 		= БазовыеНастройки.Перезаписывать;
	ВариантНумерации 	= БазовыеНастройки.ВариантНумерации;
	
	Если Не Включить Тогда
		Возврат;
	КонецЕсли;
	
	Если ВариантНумерации = 1 Тогда
		ЗаполнитьНастройкиФорматаДаты();
	ИначеЕсли ВариантНумерации = 2 Тогда
		ЗаполнитьНастройкиПоРеквизиту();
	КонецЕсли;
	
	ОбновитьСчетчики();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиФорматаДаты()
	
	Если НЕ НастройкиНумерации.Свойство("ФорматДаты") Тогда
		ЗаполнитьНастройкиФорматаДатыПоУмолчанию();
		Возврат;
	КонецЕсли;
	
	ПериодНумерации = НастройкиНумерации.ПериодНумерации;
	
	НастройкиФорматаДаты = ун30_Сервер.ПолучитьНастройкиФорматаДаты(НастройкиНумерации.ФорматДаты);
	ФорматДаты 		= НастройкиФорматаДаты.ФорматДаты;
	РазделительДаты = НастройкиФорматаДаты.Разделитель;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкуФорматаДаты()
	
	Если ФорматДаты = 1 Тогда
		НастройкиНумерации.Вставить("ФорматДаты", СтрШаблон("10&01&21~%1", РазделительДаты));
	ИначеЕсли ФорматДаты = 2 Тогда
		НастройкиНумерации.Вставить("ФорматДаты", СтрШаблон("10&01~%1", РазделительДаты));
	КонецЕсли;
	
	НастройкиНумерации.Вставить("ПериодНумерации", ПериодНумерации);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкуРеквизита()
	
	НастройкиНумерации.Вставить("ИмяРеквизита", РеквизитДокумента);
	
	Если ПрефиксыРеквизитов.Количество() > 0 Тогда
		СтрокиПрефиксов = Новый Массив;
		Для каждого Стр Из ПрефиксыРеквизитов Цикл
			Строка = Новый Структура;
			Строка.Вставить("ИмяДокумента", ИмяДокумента);
			Строка.Вставить("ИмяРеквизита", РеквизитДокумента);
			Строка.Вставить("ЗначениеРеквизита", Стр.ЗначениеРеквизита);
			Строка.Вставить("Префикс", Стр.Префикс);
			
			СтрокиПрефиксов.Добавить(Строка);
		КонецЦикла;
		РегистрыСведений.ун30_ПрефиксыРеквизитов.ЗаписатьСтрокиПрефиксов(СтрокиПрефиксов);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиПоРеквизиту()
	РеквизитДокумента = НастройкиНумерации.ИмяРеквизита;
	ЗаполнитьПрефиксыРеквизитов();
КонецПроцедуры



#КонецОбласти



#Область ВспомогательныеМетоды

&НаСервере
Процедура НастроитьВидимость()
	
	Элементы.ВариантНумерации.Видимость 		= Включить;
	Элементы.Перезаписывать.Видимость 			= Включить;
	Элементы.ПримерНомера.Видимость 			= Включить;
	Элементы.ПроизвольныйНомер.Видимость 		= Включить;
	Элементы.Разделитель.Видимость 				= Включить;
	Элементы.СброситьПорядковыйНомер.Видимость 	= Включить;
	Элементы.ПорядковыйНомер.Видимость 			= Включить;
	Элементы.Счетчик.Видимость 					= Включить;
	Элементы.ОбновитьСчетчик.Видимость 			= Включить;
	Элементы.ГодСчетчика.Видимость 				= Включить;
	Элементы.ОчиститьТекущиеНомера.Видимость 	= Включить;

	Элементы.ГруппаВариантПоДате.Видимость = Включить И ВариантНумерации = 1;
	Элементы.ГруппаВариантПоРеквизиту.Видимость = Включить И ВариантНумерации = 2;

КонецПроцедуры

&НаСервере
Процедура СФормироватьПримерНомера()
	Если ВариантНумерации = 1 Тогда
		СформироватьПримерНомераПоДате();
	ИначеЕсли ВариантНумерации = 2 Тогда
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьПримерНомераПоДате() 
	
	БазовыеНастройки = Новый Структура;
	БазовыеНастройки.Вставить("ИмяДокумента", ИмяДокумента);
	БазовыеНастройки.Вставить("ДатаИсточника", ТекущаяДатаСеанса());
	БазовыеНастройки.Вставить("Разделитель", Разделитель);
	
	ПримерНомера = ун30_Сервер.СформироватьПримерНомераПоДате(СтруктураДанные(), БазовыеНастройки, 1);
	
КонецПроцедуры

&НаСервере
Процедура ПериодНумерацииПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПериодНумерацииПриИзменении(Элемент)
	ПериодНумерацииПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДляДокументаПримера(Команда)
	Если Не Перезаписывать Тогда
		Сообщить("Для тестирования необходимо включить Перезаписывать");
		Возврат;
	КонецЕсли;
	ВыполнитьДляДокументаПримераНаСервере();
	
	ОбновитьСчетчики();
	
	ОповеститьОбИзменении(ДокументПример);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьДляДокументаПримераНаСервере()
	ДокументОбъект = ДокументПример.ПолучитьОбъект();
	ДокументОбъект.Записать();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораФорматаДаты()
	
	Элементы.ФорматДаты.СписокВыбора.Добавить(1, "день.месяц.год");
	Элементы.ФорматДаты.СписокВыбора.Добавить(2, "месяц.год");
	Элементы.ФорматДаты.СписокВыбора.Добавить(3, "день.месяц");
	
КонецПроцедуры

&НаСервере
Функция СтруктураДанные()
	
	Данные = Новый Структура;
	Данные.Вставить("ИмяДокумента", ИмяДокумента);
	Данные.Вставить("ПроизвольныйНомер", ПроизвольныйНомер);
	Данные.Вставить("ПорядковыйНомер", ПорядковыйНомер);
	Данные.Вставить("ФорматДаты", ФорматДаты);
	Данные.Вставить("Разделитель", РазделительДаты);
	Данные.Вставить("Дата", Дата(ГодСчетчика, 1 ,1));
	Возврат Данные;
	
КонецФункции

&НаКлиенте
Процедура ОчиститьТекущиеНомераПродолжение(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьТекущиеНомераНаСервере();
	ОбновитьСчетчики();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТекущиеНомераНаСервере() Экспорт
	
	Набор = РегистрыСведений.ун30_ТекущиеНомераДокументов.СоздатьНаборЗаписей();
	Набор.Отбор.ИмяДокумента.Установить(ИмяДокумента);
	Набор.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиФорматаДатыПоУмолчанию()

	ФорматДаты = 2;
	РазделительДаты = "-";
	ПериодНумерации = 3;
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыДокументаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура("ИмяДокумента", ИмяДокумента);
	ОткрытьФорму("ВнешняяОбработка.ун30_ПанельУправления.Форма.ФормаВыбораРеквизитаДокумента", ПараметрыФормы, ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Перем Команда;
	
	ВыбранноеЗначение.Свойство("Команда", Команда);
		
	Если Команда = "ВыборРеквизитаДокумента" Тогда
		РеквизитДокумента = ВыбранноеЗначение.Реквизит;
		РеквизитДокументаПриИзмененииНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТестТипа(Команда)
	ТестТипаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестТипаНаСервере()
	ПривестиТипРеквизитаДокументаККолонке();
КонецПроцедуры

&НаКлиенте
Процедура ПрефиксыРеквизитовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура РеквизитДокументаПриИзмененииНаСервере()
	мд = Метаданные.Документы.Найти(ИмяДокумента);
	мдРеквизит = мд.Реквизиты.Найти(РеквизитДокумента);
	
	Элементы.ПрефиксыРеквизитовЗначениеРеквизита.ОграничениеТипа = мдРеквизит.Тип;
КонецПроцедуры

&НаКлиенте
Процедура ПрефиксыРеквизитовПередНачаломИзменения(Элемент, Отказ)
	Элемент.ТекущиеДанные.ИмяРеквизита = РеквизитДокумента;
КонецПроцедуры

&НаКлиенте
Процедура ПрефиксыРеквизитовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Элемент.ТекущиеДанные.Реквизит = РеквизитДокумента;
	Если ЗначениеЗаполнено(РеквизитДокумента) Тогда
		ПривестиТипРеквизитаДокументаККолонке();
	КонецЕсли;
КонецПроцедуры

Процедура ПривестиТипРеквизитаДокументаККолонке()
	
	мд = Метаданные.Документы.Найти(ИмяДокумента);
	мдРеквизит = мд.Реквизиты.Найти(РеквизитДокумента);
	
	Элементы.ПрефиксыРеквизитовЗначениеРеквизита.ОграничениеТипа = мдРеквизит.Тип;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПрефиксыРеквизитов()
	
	ПрефиксыРеквизитов.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ун30_ПрефиксыРеквизитов.ИмяДокумента КАК ИмяДокумента,
	|	ун30_ПрефиксыРеквизитов.ИмяРеквизита КАК Реквизит,
	|	ун30_ПрефиксыРеквизитов.ЗначениеРеквизита КАК ЗначениеРеквизита,
	|	ун30_ПрефиксыРеквизитов.Префикс КАК Префикс
	|ИЗ
	|	РегистрСведений.ун30_ПрефиксыРеквизитов КАК ун30_ПрефиксыРеквизитов
	|ГДЕ
	|	ун30_ПрефиксыРеквизитов.ИмяДокумента = &ИмяДокумента
	|	И ун30_ПрефиксыРеквизитов.ИмяРеквизита = &ИмяРеквизита";
	Запрос.УстановитьПараметр("ИмяДокумента", ИмяДокумента);
	Запрос.УстановитьПараметр("ИмяРеквизита", РеквизитДокумента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ПрефиксыРеквизитов.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
