
Процедура ИнициализироватьДокументыНумерации() Экспорт
	
	ДокументыНумерации.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ун30_ОбъектыНумерации.ИмяДокумента КАК ИмяДокумента,
	|	ун30_ОбъектыНумерации.ПредставлениеДокумента КАК ПредставлениеДокумента,
	|	ун30_ОбъектыНумерации.Включить КАК Включить,
	|	ун30_ОбъектыНумерации.ВариантНумерации КАК ВариантНумерации
	|ИЗ
	|	РегистрСведений.ун30_ОбъектыНумерации КАК ун30_ОбъектыНумерации";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДокументыНумерации.Добавить(), Выборка);
	КонецЦикла;
	
	Для каждого мдДокумент Из Метаданные.Документы Цикл
		Если ДокументыНумерации.Найти(мдДокумент.Имя, "ИмяДокумента") = Неопределено Тогда
			НС = ДокументыНумерации.Добавить();
			НС.ИмяДокумента = мдДокумент.Имя;
			НС.ПредставлениеДокумента = мдДокумент.Представление();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


Функция ИнициализироватьБазовыеНастройки(БазовыеНастройки)
	
	Результат = Новый Структура;
	
	Массив1 = СтрРазделить(БазовыеНастройки, "~");
	
	Для каждого ИмяНастройки Из Массив1 Цикл
		Подмассив = СтрРазделить(ИмяНастройки, "&");
		Результат.Вставить(ИмяНастройки, Подмассив[1]);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции