
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВключитьУН = Константы.ун30_Включить.Получить();
	Если ВключитьУН Тогда
		ИнициализироватьДокументыНумерации();
	КонецЕсли;
	
	НастроитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДокументыНумерации(Команда)
	ИнициализироватьДокументыНумерации();
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьДокументыНумерации()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ИнициализироватьДокументыНумерации();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ДокументыНумерацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Строка = Объект.ДокументыНумерации[ВыбраннаяСтрока];
	
	ДопПараметры = Новый Структура;
	
	ДопПараметры.Вставить("ИмяДокумента", Строка.ИмяДокумента);
	ДопПараметры.Вставить("ПредставлениеДокумента", Строка.ПредставлениеДокумента);
	
	//Оповещение = Новый ОписаниеОповещения("ОткрытьФормуНастроекНумерацииДокумента", ЭтотОбъект, ДопПараметры);
	//ПоказатьВопрос(Оповещение, "Настройка нумерации документа ?", РежимДиалогаВопрос.ДаНет, 10, КодВозвратаДиалога.Нет);
	
	ОткрытьФорму("ВнешняяОбработка.ун30_ПанельУправления.Форма.ФормаНастроекДокумента", ДопПараметры, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроекНумерацииДокумента(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("ВнешняяОбработка.ун30_ПанельУправления.Форма.ФормаНастроекДокумента", 
	ДопПараметры, 
	ЭтотОбъект,,,,, 
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ВключитьУНПриИзмененииНаСервере()
	Константы.ун30_Включить.Установить(ВключитьУН);
КонецПроцедуры

&НаКлиенте
Процедура ВключитьУНПриИзменении(Элемент)
	ВключитьУНПриИзмененииНаСервере();
	НастроитьВидимость();
КонецПроцедуры 

&НаСервере
Процедура НастроитьВидимость()
	Элементы.ДокументыНумерации.Видимость = ВключитьУН;
КонецПроцедуры





